<?php
//时间戳：就是从1970-1-1的0时0分0秒到现在一个秒数。

//设置时区
date_default_timezone_set("PRC"); //设置中国时区

//各种获取时间戳
echo "当前系统时间戳：".time()."<br/>";
echo "当前系统时间戳：".strtotime('now')."<br/>";
echo "3天前此时的时间戳：".strtotime('-3 day')."<br/>";
echo "2016-5-4的时间戳：".strtotime('2016-5-4')."<br/>";
echo "2016-5-4的时间戳：".mktime(0,0,0,5,4,2016)."<br/>";
echo "<hr/>";

//给你一个时间戳转成对应的日期
echo "1462102574时间戳的日期：".date("Y-m-d H:i:s",1462102574)."<br/>";
echo "1462102574时间戳的日期：".date("Y年m月d日 星期w",1462102574)."<br/>";
echo "1462102574时间戳的日期：".date("m/d/Y",1462102574)."<br/>";

echo "<hr/>";

//1. 将日期：2015-3-12 20:40:56 转成时间戳：
echo strtotime("2015-3-12 20:40:56")."<br/>";
//2. 将时间戳：1462362160 转成对应:年-月-日 时:分:秒
echo date("Y-m-d H:i:s",1462362160)."<br/>";
//3. 获取2016年2月的天数。
echo date("t",mktime(0,0,0,2,1,2016))."<br/>";
echo date("t",strtotime('2016-2-1'))."<br/>";
//4. 获取今天是今年的第多少天。
echo date("z");





